{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "27_pad", "class_name": "ZeroPadding2D", "config": {"name": "27_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "27", "class_name": "Conv2D", "config": {"name": "27", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["27_pad", 0, 0, {}]]]}, {"name": "28", "class_name": "Activation", "config": {"name": "28", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["27", 0, 0, {}]]]}, {"name": "29_pad", "class_name": "ZeroPadding2D", "config": {"name": "29_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["28", 0, 0, {}]]]}, {"name": "29", "class_name": "Conv2D", "config": {"name": "29", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["29_pad", 0, 0, {}]]]}, {"name": "30", "class_name": "Activation", "config": {"name": "30", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["29", 0, 0, {}]]]}, {"name": "31_pad", "class_name": "ZeroPadding2D", "config": {"name": "31_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["30", 0, 0, {}]]]}, {"name": "31", "class_name": "MaxPooling2D", "config": {"name": "31", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["31_pad", 0, 0, {}]]]}, {"name": "32_pad", "class_name": "ZeroPadding2D", "config": {"name": "32_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["31", 0, 0, {}]]]}, {"name": "32", "class_name": "Conv2D", "config": {"name": "32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["32_pad", 0, 0, {}]]]}, {"name": "33", "class_name": "Activation", "config": {"name": "33", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["32", 0, 0, {}]]]}, {"name": "34_pad", "class_name": "ZeroPadding2D", "config": {"name": "34_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "34", "class_name": "Conv2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["34_pad", 0, 0, {}]]]}, {"name": "35", "class_name": "Activation", "config": {"name": "35", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "36_pad", "class_name": "ZeroPadding2D", "config": {"name": "36_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "36", "class_name": "MaxPooling2D", "config": {"name": "36", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["36_pad", 0, 0, {}]]]}, {"name": "37_pad", "class_name": "ZeroPadding2D", "config": {"name": "37_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["36", 0, 0, {}]]]}, {"name": "37", "class_name": "Conv2D", "config": {"name": "37", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["37_pad", 0, 0, {}]]]}, {"name": "38", "class_name": "Activation", "config": {"name": "38", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["37", 0, 0, {}]]]}, {"name": "39_pad", "class_name": "ZeroPadding2D", "config": {"name": "39_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["38", 0, 0, {}]]]}, {"name": "39", "class_name": "Conv2D", "config": {"name": "39", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["39_pad", 0, 0, {}]]]}, {"name": "40", "class_name": "Activation", "config": {"name": "40", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["39", 0, 0, {}]]]}, {"name": "41_pad", "class_name": "ZeroPadding2D", "config": {"name": "41_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["40", 0, 0, {}]]]}, {"name": "41", "class_name": "Conv2D", "config": {"name": "41", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["41_pad", 0, 0, {}]]]}, {"name": "42", "class_name": "Activation", "config": {"name": "42", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["41", 0, 0, {}]]]}, {"name": "43_pad", "class_name": "ZeroPadding2D", "config": {"name": "43_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["42", 0, 0, {}]]]}, {"name": "43", "class_name": "MaxPooling2D", "config": {"name": "43", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["43_pad", 0, 0, {}]]]}, {"name": "44_pad", "class_name": "ZeroPadding2D", "config": {"name": "44_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["43", 0, 0, {}]]]}, {"name": "44", "class_name": "Conv2D", "config": {"name": "44", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["44_pad", 0, 0, {}]]]}, {"name": "45", "class_name": "Activation", "config": {"name": "45", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["44", 0, 0, {}]]]}, {"name": "46_pad", "class_name": "ZeroPadding2D", "config": {"name": "46_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["45", 0, 0, {}]]]}, {"name": "46", "class_name": "Conv2D", "config": {"name": "46", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["46_pad", 0, 0, {}]]]}, {"name": "47", "class_name": "Activation", "config": {"name": "47", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["46", 0, 0, {}]]]}, {"name": "48_pad", "class_name": "ZeroPadding2D", "config": {"name": "48_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["47", 0, 0, {}]]]}, {"name": "48", "class_name": "Conv2D", "config": {"name": "48", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["48_pad", 0, 0, {}]]]}, {"name": "49", "class_name": "Activation", "config": {"name": "49", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["48", 0, 0, {}]]]}, {"name": "50_pad", "class_name": "ZeroPadding2D", "config": {"name": "50_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["49", 0, 0, {}]]]}, {"name": "50", "class_name": "MaxPooling2D", "config": {"name": "50", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["50_pad", 0, 0, {}]]]}, {"name": "51_pad", "class_name": "ZeroPadding2D", "config": {"name": "51_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["50", 0, 0, {}]]]}, {"name": "51", "class_name": "Conv2D", "config": {"name": "51", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["51_pad", 0, 0, {}]]]}, {"name": "52", "class_name": "Activation", "config": {"name": "52", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["51", 0, 0, {}]]]}, {"name": "53_pad", "class_name": "ZeroPadding2D", "config": {"name": "53_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["52", 0, 0, {}]]]}, {"name": "53", "class_name": "Conv2D", "config": {"name": "53", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["53_pad", 0, 0, {}]]]}, {"name": "54", "class_name": "Activation", "config": {"name": "54", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["53", 0, 0, {}]]]}, {"name": "55_pad", "class_name": "ZeroPadding2D", "config": {"name": "55_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["54", 0, 0, {}]]]}, {"name": "55", "class_name": "Conv2D", "config": {"name": "55", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["55_pad", 0, 0, {}]]]}, {"name": "56", "class_name": "Activation", "config": {"name": "56", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["55", 0, 0, {}]]]}, {"name": "output_0_pad", "class_name": "ZeroPadding2D", "config": {"name": "output_0_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["56", 0, 0, {}]]]}, {"name": "output_0", "class_name": "MaxPooling2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["output_0_pad", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}